Revit 2027 API
CategorySet.Insert Method
Insert the specified category into the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual bool Insert(
	Category item
)
Public Overridable Function Insert (
	item As Category
) As Boolean
public:
virtual bool Insert(
	Category^ item
)
abstract Insert :
        item : Category -> bool
override Insert :
        item : Category -> bool
Parameters
item Category
The item to be inserted into the set.
Return Value
Boolean
Returns whether the item was inserted into the set.
See Also
Reference
CategorySet Class
Autodesk.Revit.DB Namespace